// Возвращает массив в свойств. Требования к свойствам такие же как при объявлении структуры.
// 
// Параметры:
//	Значение	- Строка - свойства через запятую 
//              - Массив - возвращается в исходном массиве
// Возвращаемое значение:
//	Массив - массив свойств
//
Функция Массив(Значение) Экспорт
	ТипЗначения = ТипЗнч(Значение);
	Если ТипЗначения = Тип("Массив") Тогда
		Возврат Значение;
	КонецЕсли;
	Если ТипЗначения = Тип("Строка") И НЕ ПустаяСтрока(Значение) Тогда
		Возврат СтрРазделить(СтрЗаменить(СтрЗаменить(Значение, " ", ""), Символы.ПС, ""), ",", Ложь);
	КонецЕсли;
	Возврат Новый Массив;
КонецФункции

Функция CamelCase(Строка) Экспорт
	Состав = СтрРазделить(Строка, " ", Ложь);
	Для й = 0 По Состав.ВГраница() Цикл
		Слово = Состав[й];
		Состав[й] = ВРег(Лев(Слово, 1)) + НРег(Прав(Слово, СтрДлина(Слово) - 1));
	КонецЦикла;
	Возврат СтрСоединить(Состав, "");
КонецФункции

Функция ФорматДатаВремя(ДатаВремя) Экспорт
	СоставДаты = Новый Массив;
	СоставДаты.Добавить(Год(ДатаВремя));
	СоставДаты.Добавить(Месяц(ДатаВремя));
	СоставДаты.Добавить(День(ДатаВремя));
	Если НачалоДня(ДатаВремя) <> ДатаВремя Тогда
		СоставДаты.Добавить(Час(ДатаВремя));
		СоставДаты.Добавить(Минута(ДатаВремя));
		СоставДаты.Добавить(Секунда(ДатаВремя));
	КонецЕсли;
	Возврат СтрЗаменить("ДАТАВРЕМЯ("+СтрСоединить(СоставДаты, ",")+")", Символы.НПП, "");
КонецФункции

Функция ЭкранироватьТекст(Знач ТекстоваяСтрока) Экспорт
	ТекстоваяСтрока = СтрЗаменить(ТекстоваяСтрока, Символы.ПС, Символы.ПС+"|");
	ТекстоваяСтрока = СтрЗаменить(ТекстоваяСтрока, """", """""");
	Возврат ТекстоваяСтрока;
КонецФункции

// Возвращает эквивалент имени по значению уникального идентификатора
//
// Параметры:
//  УИД - Уникальный идентификатор - Значение уникального идентификатора
//
// Возвращаемое значение:
//   Имя - Строка, удовлетворяющая требованиям имен переменных
//
Функция ИмяПоУникальномуИдентификатору(Знач УИД = Неопределено) Экспорт
	Если УИД = Неопределено Тогда
		УИД = Новый УникальныйИдентификатор;
	КонецЕсли;
	Возврат "_" + СтрЗаменить(Строка(УИД), "-", "_");
КонецФункции

Функция ОкончаниеСтрокиПослеРазделителя(Строка, Разделитель = ".") Экспорт
	Возврат Сред(Строка, СтрНайти(Строка, Разделитель, НаправлениеПоиска.СКонца)+1);
КонецФункции

Функция НачалоСтрокиПослеРазделителя(Строка, Разделитель = ".") Экспорт
	Возврат Сред(Строка, СтрНайти(Строка, Разделитель, НаправлениеПоиска.СНачала)+1);
КонецФункции
