// @strict-types

#Область ПрограммныйИнтерфейс

// Обработать запрос.
// 
// Параметры:
//  Запрос - HTTPСервисЗапрос - Запрос
//  МетодОбработчик - Строка -  Имя экспортного метода обработчика. Параметры: Запрос, МетаданныеСервиса. Возвращает HTTPСервисОтвет
//  МетаданныеСервиса - ОбъектМетаданныхHTTPСервис - Метаданные ХТТП сервиса 
//  УстанавливатьТранзакцию - Булево -  указывает требуется ли устанавливать верхнеуровневую транзакцию
// 
// Возвращаемое значение:
// HTTPСервисОтвет - Ответ
Функция ОбработатьЗапрос(Запрос, МетодОбработчик, МетаданныеСервиса, УстанавливатьТранзакцию = Ложь) Экспорт
	
	Если УстанавливатьТранзакцию Тогда
		//@skip-check begin-transaction
		НачатьТранзакцию();	
	КонецЕсли;
	
	Попытка
		
		//@skip-check server-execution-safe-mode
		Результат = Вычислить(МетодОбработчик + "(Запрос, МетаданныеСервиса)"); // HTTPСервисОтвет
		
		Если УстанавливатьТранзакцию Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Исключение
		
		Если УстанавливатьТранзакцию Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		Возврат ОбработатьИсключениеВызова(Запрос, МетаданныеСервиса, ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработатьИсключениеВызова(Запрос, МетаданныеСервиса, ИнформацияОбОшибке)
	
	ПростойТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);

	Если СтрНайти(ПростойТекстОшибки, бф_ОбработкаЗапросовПовтИсп.БазовыйКодОшибкиПроверки()) Тогда
		Возврат бф_СервисыОбщее.ПлохойЗапрос(ПростойТекстОшибки);
	КонецЕсли;

	ПодробныйТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	
	ИдентификаторОшибки = ЗарегистрироватьОшибку(Запрос, МетаданныеСервиса, ИнформацияОбОшибке);
	
	ИтоговыйТекстОшибки = ?(
		бф_ОбработкаЗапросовПовтИсп.ВыводитьПодробноеОписаниеОшибок(),
		СтрШаблон(
			"%1",
			ПодробныйТекстОшибки
		),
		""
	);
	
	Возврат бф_СервисыОбщее.ОшибкаСервера(ИтоговыйТекстОшибки, ИдентификаторОшибки);
	
КонецФункции

Функция ЗарегистрироватьОшибку(Запрос, МетаданныеСервиса, ИнформацияОбОшибке)
	
	ИдентификаторОшибки = ВРег(бф_ХТТПСлужебный.КонтрольнаяСуммаСтрокой(Новый УникальныйИдентификатор()));
	
	ИмяСобытия = СтрШаблон(
		"%1.%2.%3.%4",
		бф_ОбработкаЗапросовПовтИсп.БазовыйКодЖурналаРегистрации(),
		МетаданныеСервиса.КорневойURL,
		СтрСоединить(СтрРазделить(Запрос.ОтносительныйURL, "/", Ложь), "."),
		Запрос.HTTPМетод
	);
	
	ТекстОшибки = СформироватьТекстОшибки(Запрос, ИнформацияОбОшибке);
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытия,
		УровеньЖурналаРегистрации.Ошибка,
		МетаданныеСервиса,
		ИдентификаторОшибки,
		ТекстОшибки
	);
	
	Возврат ИдентификаторОшибки;
	
КонецФункции

Функция СформироватьТекстОшибки(Запрос, ИнформацияОбОшибке)
	
	ДанныеОшибки = Новый Соответствие();
	ДанныеОшибки.Вставить("ТекстОшибки", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	
	ДанныеОшибки.Вставить("Заголовки", Новый Соответствие());
	бф_ХТТПСлужебный.ДополнитьСоответствие(ДанныеОшибки.Получить("Заголовки"), Запрос.Заголовки);
	ДанныеОшибки.Получить("Заголовки").Удалить("Authorization");
	
	ДанныеОшибки.Вставить("ПараметрыURL", Новый Соответствие());
	бф_ХТТПСлужебный.ДополнитьСоответствие(ДанныеОшибки.Получить("ПараметрыURL"), Запрос.ПараметрыURL);
	
	ДанныеОшибки.Вставить("ПараметрыЗапроса", Новый Соответствие());
	бф_ХТТПСлужебный.ДополнитьСоответствие(ДанныеОшибки.Получить("ПараметрыЗапроса"), Запрос.ПараметрыЗапроса);
	
	РазмерТела = Запрос.ПолучитьТелоКакПоток().Размер();
	Если РазмерТела < бф_ОбработкаЗапросовПовтИсп.МаксимальныйРазмерТелаДляЛогирования() Тогда 
		ДанныеОшибки.Вставить("ТелоЗапроса", Base64Строка(Запрос.ПолучитьТелоКакДвоичныеДанные()));
	Иначе
		ДанныеОшибки.Вставить("ПревышенЛимит", Истина);
		ДанныеОшибки.Вставить("ИсходныйРазмер", РазмерТела);
	КонецЕсли;
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеОшибки);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

#КонецОбласти
