// @strict-types

#Область ПрограммныйИнтерфейс

//@skip-check module-empty-method
// Выводить подробное описание ошибок.
// 
// Параметры:
//  Результат - Булево - Переопределяемый флаг
Процедура ВыводитьПодробноеОписаниеОшибок(Результат) Экспорт
	Результат = Истина;
КонецПроцедуры

//@skip-check module-empty-method
// Максимальный размер тела для логирования
// 
// Параметры:
//  Результат - Число - Переопределяемый размер
Процедура МаксимальныйРазмерТелаДляЛогирования(Результат) Экспорт

КонецПроцедуры

#КонецОбласти

