// @strict-types


/////////////////////////////////////////////////////////////////////////////////
// Экспортные процедуры и функции, предназначенные для использования другими 
// объектами конфигурации или другими программами
///////////////////////////////////////////////////////////////////////////////// 
#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТест("тест_POST");
		
КонецПроцедуры

#Область События

Процедура ПередВсемиТестами() Экспорт
	
КонецПроцедуры

Процедура ПередКаждымТестом() Экспорт
	
КонецПроцедуры

Процедура ПослеКаждогоТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеВсехТестов() Экспорт
	
КонецПроцедуры

#КонецОбласти

Процедура тест_POST() Экспорт
	
	Параметры = бф_КоннекторХТТП.НовыеПараметры();
	Параметры.Json = Новый Структура("testField1,testField2", "field1", 5);
	// Запуск в CI обращается в поднимаемому сервису
	СистемнаяИнформация = Новый СистемнаяИнформация();
	Если СтрНайти(ВРЕГ(СистемнаяИнформация.ВерсияОС), "WINDOWS") = 0 Тогда
		URI = "http://httpbin/post";
	Иначе
		URI = "http://httpbin.org/post";
	КонецЕсли;
	Результат = бф_КоннекторХТТП.Post(URI, , Параметры);
	
	ЮТест.ОжидаетЧто(Результат)
		.Свойство("КодСостояния").Меньше(300);
	ЮТест.ОжидаетЧто(бф_КоннекторХТТП.КакJson(Результат))
		.Свойство("json.testField1").Равно("field1").Объект()
		.Свойство("json.testField2").Равно(5);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
