// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Базовый код ошибки проверки.
// 
// Возвращаемое значение:
//  Строка - Базовый код ошибки проверки
Функция БазовыйКодОшибкиПроверки() Экспорт
	
	Возврат "[CheckFailed]";

КонецФункции

// Базовый код журнала регистрации
// 
// Возвращаемое значение:
//  Строка - Базовый код ошибки проверки
Функция БазовыйКодЖурналаРегистрации() Экспорт
	
	Возврат "ОшибкаХТТПСервиса";

КонецФункции

// Флаг подробного вывода ошибок клиенту
// 
// Возвращаемое значение:
//  Булево - Выводить подробное описание ошибок
Функция ВыводитьПодробноеОписаниеОшибок() Экспорт
	Результат = Ложь;
	бф_ОбработкаЗапросовПереопределяемый.ВыводитьПодробноеОписаниеОшибок(Результат);
	Возврат Результат;
КонецФункции

// Максимальный размер тела для логирования.
// 
// Возвращаемое значение:
//  Число - Максимальный размер тела для логирования
Функция МаксимальныйРазмерТелаДляЛогирования() Экспорт
	Результат = 5 * 1024 * 1024;
	бф_ОбработкаЗапросовПереопределяемый.МаксимальныйРазмерТелаДляЛогирования(Результат);
	Возврат Результат;
КонецФункции

#КонецОбласти
