// @strict-types


/////////////////////////////////////////////////////////////////////////////////
// Экспортные процедуры и функции, предназначенные для использования другими 
// объектами конфигурации или другими программами
///////////////////////////////////////////////////////////////////////////////// 
#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТест("тест_ИнциализацияИзКоллекции", "Иницилизация из коллекции")
		.ДобавитьТест("тест_ИнциализацияИзНабора", "Инициализация из набора")
		.ДобавитьТест("тест_СтандартнаяСортировка", "Сортировка коллекции")
	;
		
КонецПроцедуры

#Область События

Процедура ПередВсемиТестами() Экспорт
	
КонецПроцедуры

Процедура ПередКаждымТестом() Экспорт
	
КонецПроцедуры

Процедура ПослеКаждогоТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеВсехТестов() Экспорт
	
КонецПроцедуры

#КонецОбласти

Процедура тест_ИнциализацияИзКоллекции() Экспорт

	Числа = НовыеЧисла();
	Коллекция = бф_ПроцессорыКоллекций.ИзКоллекции(Числа);
	ЮТест.ОжидаетЧто(Коллекция.ВМассив()).Равно(Числа);
	
		
КонецПроцедуры

Процедура тест_ИнциализацияИзНабора() Экспорт

	Числа = НовыеЧисла();
	
	Коллекция = бф_ПроцессорыКоллекций.ИзНабора(
		Числа.Получить(0),
		Числа.Получить(1),
		Числа.Получить(2),
		Числа.Получить(3),
		Числа.Получить(4),
		Числа.Получить(5),
	);
	ЮТест.ОжидаетЧто(Коллекция.ВМассив()).Равно(Числа);
	
		
КонецПроцедуры

Процедура тест_СтандартнаяСортировка() Экспорт

	Числа = НовыеЧисла();
	
	Коллекция = бф_ПроцессорыКоллекций.ИзКоллекции(Числа).Сортировать();
	
	ПредыдущееЗначение = 0;
	
	Для Каждого Элемент Из Коллекция.ВМассив() Цикл
		ЮТест.ОжидаетЧто(ПредыдущееЗначение).МеньшеИлиРавно(Элемент);
		//@skip-check statement-type-change
		ПредыдущееЗначение = Элемент;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыеЧисла()
	Массив = Новый Массив; // Массив из Число
	Массив.Добавить(1);
	Массив.Добавить(5);
	Массив.Добавить(2);
	Массив.Добавить(92);
	Массив.Добавить(7);
	Массив.Добавить(2);
	
	Возврат Массив;
	
КонецФункции

#КонецОбласти
