// @strict-types
//@skip-check module-empty-method

#Область ПрограммныйИнтерфейс

// Вызывается при чтении параметра запроса в методе см. бф_СервисыОбщее.ПараметрыЗапроса
// В данном параметре можно реализовать "собственный" тип и алгоритм его конвертации в прикладной тип
// Параметры:
//  Параметр - см. бф_СервисыОбщее.НовыйПараметрЗапроса
//  Значение - Произвольный - Значение, куда надо поместить результат конвертации
//  ЗначениеПрочитано - Булево - Признак того, что значение вообще было прочитано, иначе это неизвестный для нас тип
Процедура ПриЧтенииПараметраЗапроса(Параметр, Значение, ЗначениеПрочитано) Экспорт
	
КонецПроцедуры

#КонецОбласти

