// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область СлужебныйПрограммныйИнтерфейс

// Восстановить из гуида.
// 
// Параметры:
//  ГУИД - Строка
//  ДопПараметры - Неопределено - Доп параметры
// 
// Возвращаемое значение:
//  СправочникСсылка.тест_Справочник
Функция ВосстановитьИзГуида(ГУИД, ДопПараметры = Неопределено) Экспорт
	Возврат бф_СервисыОбщее.СсылкаПоИдентификатору(ТипЗнч(ПустаяСсылка()), ГУИД);
КонецФункции

#КонецОбласти

#КонецЕсли
